//竞猜相关公共处理
export default {
  allMap: {
    "SPF": "赛事胜平负",
    "RQSF": "赛事让球胜负",
    "DXQ": "赛事大小球",
    "SF": "赛事胜负",
    "RFSF": "赛事让分胜负",
    "DXF": "赛事大小分",
    "JCLQDXF"  : "竞彩大小分",
    "JCLQRFSF" : "竞彩让分胜负",
    "JCLQSF"   : "竞彩胜负",
    "JCRQSF"   : "竞彩让球胜平负",
    "JCSPF"    : "竞彩胜平负",
    "LQDXF"    : "赛事大小分",
    "LQRFSF"   : "赛事让分胜负",
    "LQSF"     : "赛事胜负",
  },
  kindMap: {
    "SPF": "胜平负",
    "RQSF": "让球胜负",
    "DXQ": "大小球",

    "GQ100": "猜90分钟胜平负",
    "GQ130": "入球数单双",
    "GQ140": "全场比分",
    "GQ410": "总进球数",
    "GQ350": "下一个进球",
    "GQ110": "让球",
    "GQ120": "大小球",

    "SF": "猜胜负",
    "RFSF": "让分胜负",
    "DXF": "大小分"
  },
  descMap: {
    "SPF": "猜90分钟(含伤停补时)比赛结果",
    "RQSF": "猜90分钟(含伤停补时)的让球胜负结果",
    "DXQ": "猜90分钟(含伤停补时)两队总进球数的大小",

    "GQ130": "猜90分钟(含伤停补时)两队进球总数是单数还是双数",
    "GQ140": "猜90分钟(含伤停补时)最终比分",
    "GQ410": "猜90分钟(含伤停补时)两队的总进球个数",
    "GQ350": "猜90分钟(含伤停补时)下一个进球的球队",

    "GQ100": "猜90分钟(含伤停补时)比赛结果",
    "GQ110": "猜当前比分下的让球胜负结果",
    "GQ120": "猜90分钟(含伤停补时)两队总进球数的大小",

    "SF": "猜胜负",
    "RFSF": "让分胜负",
    "DXF": "大小分"
  },
  betStateMap:{
    "-2":"订单取消",
    "1":"等待开奖",
    "2":"出票中",
    "3":"等待开奖",
    "4":"派奖中",
    "5":"已派奖"
  },
  matchStateMap: {
    "0": "未开",
    "1": "上半场",
    "2": "中场",
    "3": "下半场",
    "4": "加时",
    "-11": "待定",
    "-12": "腰斩",
    "-13": "中断",
    "-14": "推迟",
    "-1":  "完赛",
    "-10": "取消"
  },
  LqMatchStateMap: {
    "0": "未开",
    "1": "第1节",
    "2": "第2节",
    "3": "第3节",
    "4": "第4节",
    "5": "加时1",
    "6": "加时2",
    "7": "加时3",
    "8": "加时4",
    "9": "加时5",
    "-1": "完场",
    "-2": "待定",
    "-3": "中断",
    "-4": "取消",
    "-5": "推迟",
    "50": "中场"
  },
  prizeMap:{
    "0":"等待开奖",
    "1":"已中奖",
    "2":"未中奖",
    "3":"订单取消",
    "15":"派奖中"
  },
  dynamicMap: {
    "SPF": {
      "3": "主胜",
      "1": "平",
      "0": "主负"
    },
    "RQSF": {
      "2": "上盘",
      "1": "下盘"
    },
    "DXQ": {
      "2": "大球",
      "1": "小球"
    },
    "SF": {
      "3": "主胜",
      "0": "主负"
    },
    "RFSF": {
      "2": "主胜",
      "1": "主负"
    },
    "DXF": {
      "2": "大分",
      "1": "小分"
    },
    "GQ100": {
      "1": "主胜",
      "0": "平",
      "-1": "客胜"
    },
    "GQ350": {
      "1": "主队进球",
      "0": "无进球",
      "-1": "客队进球"
    },
    "GQ130": {
      "1": "单",
      "-1": "双"
    },
    "GQ140": {
      "1": "其他比分",
      "2": "胜其他",
      "3": "平其他",
      "4": "负其他",
      "10001": "0:0",
      "10002": "1:0",
      "10003": "2:0",
      "10004": "3:0",
      "10005": "4:0",
      "10006": "5:0",
      "10007": "6:0",

      "20001": "0:1",
      "20002": "1:1",
      "20003": "2:1",
      "20004": "3:1",
      "20005": "4:1",
      "20006": "5:1",
      "20007": "6:1",

      "30001": "0:2",
      "30002": "1:2",
      "30003": "2:2",
      "30004": "3:2",
      "30005": "4:2",
      "30006": "5:2",
      "30007": "6:2",

      "40001": "0:3",
      "40002": "1:3",
      "40003": "2:3",
      "40004": "3:3",
      "40005": "4:3",
      "40006": "5:3",
      "40007": "6:3",
      "50001": "0:4",
      "50002": "1:4",
      "50003": "2:4",
      "50004": "3:4",
      "50005": "4:4",
      "50006": "5:4",
      "50007": "6:4",

      "60001": "0:5",
      "60002": "1:5",
      "60003": "2:5",
      "60004": "3:5",
      "60005": "4:5",
      "60006": "5:5",
      "60007": "6:5",

      "70001": "0:6",
      "70002": "1:6",
      "70003": "2:6",
      "70004": "3:6",
      "70005": "4:6",
      "70006": "5:6",
      "70007": "6:6"
    },
    "GQ410": {
      "-1": "大于6球",
      "1": "无进球",
      "2": "进1球",
      "3": "进2球",
      "4": "进3球",
      "5": "进4球",
      "6": "进5球",
      "7": "进6球"
    },
    "GQ110": {
      '90111': '主队0',
      '90113': '客队0',

      '110211': '主队让球0.0,-0.5',
      '110213': '客队受让0.0,+0.5',

      '110511': '主队让球-0.5',
      '110513': '客队受让+0.5',

      '110711': '主队让球-0.5,-1.0',
      '110713': '客队受让+0.5,+1.0',

      '210011': '主队让球-1.0',
      '210013': '客队受让+1.0',

      '210211': '主队让球-1.0,-1.5',
      '210213': '客队受让+1.0,+1.5',

      '210511': '主队让球-1.5',
      '210513': '客队受让+1.5',

      '210711': '主队让球-1.5,-2.0',
      '210713': '客队受让+1.5,+2.0',

      '310011': '主队让球-2.0',
      '310013': '客队受让+2.0',

      '310211': '主队让球-2.0,-2.5',
      '310213': '客队受让+2.0,+2.5',

      '310511': '主队让球-2.5',
      '310513': '客队受让+2.5',

      '310711': '主队让球-2.5,-3.0',
      '310713': '客队受让+2.5,+3.0',

      '410011': '主队让球-3.0',
      '410013': '客队受让+3.0',

      '410211': '主队让球-3.0,-3.5',
      '410213': '客队受让+3.0,+3.5',

      '410511': '主队让球-3.5',
      '410513': '客队受让+3.5',

      '410711': '主队让球-3.5,-4.0',
      '410713': '客队受让+3.5,+4.0',

      '510011': '主队让球-4.0',
      '510013': '客队受让+4.0',

      '510211': '主队让球-4.0,-4.5',
      '510213': '客队受让+4.0,+4.5',

      '510511': '主队让球-4.5',
      '510513': '客队受让+4.5',

      '510711': '主队让球-4.5,-5.0',
      '510713': '客队受让+4.5,+5.0',

      '610011': '主队让球-5.0',
      '610013': '客队受让+5.0',

      '610211': '主队让球-5.0,-5.5',
      '610213': '客队受让+5.0,+5.5',

      '610511': '主队让球-5.5',
      '610513': '客队受让+5.5',

      '610711': '主队让球-5.5,-6.0',
      '610713': '客队受让+5.5,+6.0',

      '710011': '主队让球-6.0',
      '710013': '客队受让+6.0',

      '710211': '主队让球-6.0,-6.5',
      '710213': '客队受让+6.0,+6.5',

      '710511': '主队让球-6.5',
      '710513': '客队受让+6.5',

      '130211': '主队受让0.0,+0.5',
      '130213': '客队让球0.0,-0.5',

      '130511': '主队受让+0.5',
      '130513': '客队让球-0.5',

      '130711': '主队受让+0.5,+1.0',
      '130713': '客队让球-0.5,-1.0',

      '230011': '主队受让+1.0',
      '230013': '客队让球-1.0',

      '230211': '主队受让+1.0,+1.5',
      '230213': '客队让球-1.0,-1.5',

      '230511': '主队受让+1.5',
      '230513': '客队让球-1.5',

      '230711': '主队受让+1.5,+2.0',
      '230713': '客队让球-1.5,-2.0',

      '330011': '主队受让+2.0',
      '330013': '客队让球-2.0',

      '330211': '主队受让+2.0,+2.5',
      '330213': '客队让球-2.0,-2.5',

      '330511': '主队受让+2.5',
      '330513': '客队让球-2.5',

      '330711': '主队受让+2.5,+3.0',
      '330713': '客队让球-2.5,-3.0',

      '430011': '主队受让+3.0',
      '430013': '客队让球-3.0',

      '430211': '主队受让+3.0,+3.5',
      '430213': '客队让球-3.0,-3.5',

      '430511': '主队受让+3.5',
      '430513': '客队让球-3.5',

      '430711': '主队受让+3.5,+4.0',
      '430713': '客队让球-3.5,-4.0',

      '530011': '主队受让+4.0',
      '530013': '客队让球-4.0',

      '530211': '主队受让+4.0,+4.5',
      '530213': '客队让球-4.0,-4.5',

      '530511': '主队受让+4.5',
      '530513': '客队让球-4.5',

      '530711': '主队受让+4.5,+5.0',
      '530713': '客队让球-4.5,-5.0',

      '630011': '主队受让+5.0',
      '630013': '客队让球-5.0',

      '630211': '主队受让+5.0,+5.5',
      '630213': '客队让球-5.0,-5.5',

      '630511': '主队受让+5.5',
      '630513': '客队让球-5.5',

      '630711': '主队受让+5.5,+6.0',
      '630713': '客队让球-5.5,-6.0',

      '730011': '主队受让+6.0',
      '730013': '客队让球-6.0',

      '730211': '主队受让+6.0,+6.5',
      '730213': '客队让球-6.0,-6.5',

      '730511': '主队受让+6.5',
      '730513': '客队让球-6.5'
    },
    "GQ120": {
      "10511": "总进球数大于0.5球",
      "10513": "总进球数小于0.5球",
      "20511": "总进球数大于1.5球",
      "20513": "总进球数小于1.5球",
      "30511": "总进球数大于2.5球",
      "30513": "总进球数小于2.5球",
      "40511": "总进球数大于3.5球",
      "40513": "总进球数小于3.5球",
      "50511": "总进球数大于4.5球",
      "50513": "总进球数小于4.5球",
      "60511": "总进球数大于5.5球",
      "60513": "总进球数小于5.5球",
      "70511": "总进球数大于6.5球",
      "70513": "总进球数小于6.5球"
    }
  },
  KindTextMap:{
      GameHomeWin:"主胜",
      GameStandoff: "平",
      GameGuestWin: "主负",
      GameBigOdds: "大球",
      GameSmallOdds: "小球",
      GameHomeOdds: "上盘",
      GameAwayOdds: "下盘"
  },
  KindBetMap:{
      GameHomeWin:"3",
      GameStandoff: "1",
      GameGuestWin: "0",
      GameBigOdds: "2",
      GameSmallOdds: "1",
      GameHomeOdds: "2",
      GameAwayOdds: "1"
  },
  kindShowMap: {
    "SPF": ["GameHomeWin","GameStandoff","GameGuestWin"],
    "RQSF": ["GameHomeOdds","GameAwayOdds"],
    "DXQ": ["GameBigOdds","GameSmallOdds"]
  },
  indexMap: {
    "SPF": {
      "3": 0,
      "1": 1,
      "0": 2
    },
    "RQSF": {
      "2": 0,
      "1": 1
    },
    "DXQ": {
      "2": 0,
      "1": 1
    }
  },
  lqMap: {
    "SF": {
      "3": 0,
      "0": 1
    },
    "RFSF": {
      "2": 0,
      "1": 1
    },
    "DXF": {
      "2": 0,
      "1": 1
    }
  },
  dailyMap: {
    "1": "大热", 
    "2": "悬殊", 
    "3": "同赔", 
    "4": "极限", 
    "5": "庄家态度"
  },
  getbetText(order) {
    var bettxt = {};
    switch (order.betKind){
      case 'SPF':
        bettxt = {
          "3": order.homeTeamName + " 胜",
          "1": "平",
          "0": order.awayTeamName + " 胜"
        }
        break;
      case 'RQSF':
        var odds = order.odds * 1;
        var oddtext = Math.abs(odds);
        if(odds * 10 % 5 != 0){
          oddtext = (Math.abs(odds) - 0.25) + "/" + (Math.abs(odds) + 0.25);
        }
         bettxt = {
            "1": order.awayTeamName + " " + (odds >= 0 ? "+" + oddtext : "-" + oddtext),
            "2": order.homeTeamName + " " + (odds >= 0 ? "-" + oddtext : "+" + oddtext),
          }
      break;
      case 'DXQ':
        var odds = order.odds*1;
        var oddtext = Math.abs(odds);
        if(odds * 10 % 5 != 0){
          oddtext = (Math.abs(odds) - 0.25) + "/" + (Math.abs(odds) + 0.25);
        }
        bettxt = {
        "1": "小于" + oddtext + "个球",
        "2": "大于" + oddtext + "个球"
      }
      break;
      case 'SF':
        bettxt = {
          "3": order.homeTeamName + "胜",
          "0": order.awayTeamName + "胜"
        }
        break;
      case 'RFSF':
        var odds = order.odds * 1;
        var abs_odds = Math.abs(odds);
        bettxt = {
          "2": order.homeTeamName + "胜" + " " + (odds > 0 ? "-" + abs_odds : "+" + abs_odds),
          "1": order.awayTeamName + "胜" + " " + (odds > 0 ? "+" + abs_odds : "-" + abs_odds)
        }
        break;
      case 'DXF':
        bettxt = {
          "2": "大于" + order.odds + "分",
          "1": "小于" + order.odds + "分"
        }
        break;
      case "GQ130": 
        bettxt = {
         "-1": "双",
         "1": "单"
        }
      break;
      case "GQ100": 
        bettxt = {
          "1": "主胜",
          "0": "平",
          "-1": "客胜"
        }
      break;
      case "GQ350": 
        bettxt = {
          "1": "主队进球",
          "0": "无进球",
          "-1": "客队进球"
        }
      break;
      case "GQ140": 
        bettxt = {
          "1": "其他比分",
          "2": "胜其他",
          "3": "平其他",
          "4": "负其他",
          "10001": "0:0",
          "10002": "1:0",
          "10003": "2:0",
          "10004": "3:0",
          "10005": "4:0",
          "10006": "5:0",
          "10007": "6:0",
          "20001": "0:1",
          "20002": "1:1",
          "20003": "2:1",
          "20004": "3:1",
          "20005": "4:1",
          "20006": "5:1",
          "20007": "6:1",
          "30001": "0:2",
          "30002": "1:2",
          "30003": "2:2",
          "30004": "3:2",
          "30005": "4:2",
          "30006": "5:2",
          "30007": "6:2",
          "40001": "0:3",
          "40002": "1:3",
          "40003": "2:3",
          "40004": "3:3",
          "40005": "4:3",
          "40006": "5:3",
          "40007": "6:3",
          "50001": "0:4",
          "50002": "1:4",
          "50003": "2:4",
          "50004": "3:4",
          "50005": "4:4",
          "50006": "5:4",
          "50007": "6:4",
          "60001": "0:5",
          "60002": "1:5",
          "60003": "2:5",
          "60004": "3:5",
          "60005": "4:5",
          "60006": "5:5",
          "60007": "6:5",
          "70001": "0:6",
          "70002": "1:6",
          "70003": "2:6",
          "70004": "3:6",
          "70005": "4:6",
          "70006": "5:6",
          "70007": "6:6"
        }
      break;
      case "GQ410": 
        bettxt = {
          "-1": "大于6球",
          "1": "无进球",
          "2": "进1球",
          "3": "进2球",
          "4": "进3球",
          "5": "进4球",
          "6": "进5球",
          "7": "进6球"
        }
      break;
      case "GQ110": 
        bettxt = {
          '90111': '主队0',
          '90113': '客队0',

          '110211': '主队让球0.0,-0.5',
          '110213': '客队受让0.0,+0.5',

          '110511': '主队让球-0.5',
          '110513': '客队受让+0.5',

          '110711': '主队让球-0.5,-1.0',
          '110713': '客队受让+0.5,+1.0',

          '210011': '主队让球-1.0',
          '210013': '客队受让+1.0',

          '210211': '主队让球-1.0,-1.5',
          '210213': '客队受让+1.0,+1.5',

          '210511': '主队让球-1.5',
          '210513': '客队受让+1.5',

          '210711': '主队让球-1.5,-2.0',
          '210713': '客队受让+1.5,+2.0',

          '310011': '主队让球-2.0',
          '310013': '客队受让+2.0',

          '310211': '主队让球-2.0,-2.5',
          '310213': '客队受让+2.0,+2.5',

          '310511': '主队让球-2.5',
          '310513': '客队受让+2.5',

          '310711': '主队让球-2.5,-3.0',
          '310713': '客队受让+2.5,+3.0',

          '410011': '主队让球-3.0',
          '410013': '客队受让+3.0',

          '410211': '主队让球-3.0,-3.5',
          '410213': '客队受让+3.0,+3.5',

          '410511': '主队让球-3.5',
          '410513': '客队受让+3.5',

          '410711': '主队让球-3.5,-4.0',
          '410713': '客队受让+3.5,+4.0',

          '510011': '主队让球-4.0',
          '510013': '客队受让+4.0',

          '510211': '主队让球-4.0,-4.5',
          '510213': '客队受让+4.0,+4.5',

          '510511': '主队让球-4.5',
          '510513': '客队受让+4.5',

          '510711': '主队让球-4.5,-5.0',
          '510713': '客队受让+4.5,+5.0',

          '610011': '主队让球-5.0',
          '610013': '客队受让+5.0',

          '610211': '主队让球-5.0,-5.5',
          '610213': '客队受让+5.0,+5.5',

          '610511': '主队让球-5.5',
          '610513': '客队受让+5.5',

          '610711': '主队让球-5.5,-6.0',
          '610713': '客队受让+5.5,+6.0',

          '710011': '主队让球-6.0',
          '710013': '客队受让+6.0',

          '710211': '主队让球-6.0,-6.5',
          '710213': '客队受让+6.0,+6.5',

          '710511': '主队让球-6.5',
          '710513': '客队受让+6.5',

          '130211': '主队受让0.0,+0.5',
          '130213': '客队让球0.0,-0.5',

          '130511': '主队受让+0.5',
          '130513': '客队让球-0.5',

          '130711': '主队受让+0.5,+1.0',
          '130713': '客队让球-0.5,-1.0',

          '230011': '主队受让+1.0',
          '230013': '客队让球-1.0',

          '230211': '主队受让+1.0,+1.5',
          '230213': '客队让球-1.0,-1.5',

          '230511': '主队受让+1.5',
          '230513': '客队让球-1.5',

          '230711': '主队受让+1.5,+2.0',
          '230713': '客队让球-1.5,-2.0',

          '330011': '主队受让+2.0',
          '330013': '客队让球-2.0',

          '330211': '主队受让+2.0,+2.5',
          '330213': '客队让球-2.0,-2.5',

          '330511': '主队受让+2.5',
          '330513': '客队让球-2.5',

          '330711': '主队受让+2.5,+3.0',
          '330713': '客队让球-2.5,-3.0',

          '430011': '主队受让+3.0',
          '430013': '客队让球-3.0',

          '430211': '主队受让+3.0,+3.5',
          '430213': '客队让球-3.0,-3.5',

          '430511': '主队受让+3.5',
          '430513': '客队让球-3.5',

          '430711': '主队受让+3.5,+4.0',
          '430713': '客队让球-3.5,-4.0',

          '530011': '主队受让+4.0',
          '530013': '客队让球-4.0',

          '530211': '主队受让+4.0,+4.5',
          '530213': '客队让球-4.0,-4.5',

          '530511': '主队受让+4.5',
          '530513': '客队让球-4.5',

          '530711': '主队受让+4.5,+5.0',
          '530713': '客队让球-4.5,-5.0',

          '630011': '主队受让+5.0',
          '630013': '客队让球-5.0',

          '630211': '主队受让+5.0,+5.5',
          '630213': '客队让球-5.0,-5.5',

          '630511': '主队受让+5.5',
          '630513': '客队让球-5.5',

          '630711': '主队受让+5.5,+6.0',
          '630713': '客队让球-5.5,-6.0',

          '730011': '主队受让+6.0',
          '730013': '客队让球-6.0',

          '730211': '主队受让+6.0,+6.5',
          '730213': '客队让球-6.0,-6.5',

          '730511': '主队受让+6.5',
          '730513': '客队让球-6.5'
        }
      break; 
      case "GQ120": 
        bettxt = {
          "10511": "总进球数大于0.5球",
          "10513": "总进球数小于0.5球",
          "20511": "总进球数大于1.5球",
          "20513": "总进球数小于1.5球",
          "30511": "总进球数大于2.5球",
          "30513": "总进球数小于2.5球",
          "40511": "总进球数大于3.5球",
          "40513": "总进球数小于3.5球",
          "50511": "总进球数大于4.5球",
          "50513": "总进球数小于4.5球",
          "60511": "总进球数大于5.5球",
          "60513": "总进球数小于5.5球",
          "70511": "总进球数大于6.5球",
          "70513": "总进球数小于6.5球"
        }
      break;  
    }
    return bettxt[order.betCode];
  },
  getHandicap(kind, odds) {
    var handicap = Math.abs(odds);
    if(odds * 10 % 5){
      handicap = (Math.abs(odds) - 0.25) + "/" + (Math.abs(odds) + 0.25);
    }
    var handArr = [handicap];
    if(kind == "RQSF"){
      handArr = [odds >= 0 ? ("-" + handicap) : ("+" + handicap), odds >= 0 ? ("+" + handicap) : ("-" + handicap)];
    }
    return handArr;
  },
  prizeResult(order){
    //服务端算是否中奖，前端只展现中没中
    var result = {
      betKind: order.betKind,
      odds: order.odds,
      homeTeamName: order.homeTeamName,
      awayTeamName: order.awayTeamName,
      zou: order.zou
    };
    var homeG = order.homeWholeGoals*1;
    var awayG = order.awayWholeGoals*1;
    
    result.Text=" (最终比分 " + homeG + ":" + awayG + ")";
      
    var t = "";
    switch (result.betKind){
      case 'SPF':
       
        if(homeG>awayG){
          result.betCode = 3;
          t = order.homeTeamName + " 胜 ";
        }else if(homeG == awayG){
          result.betCode = 1;
          t = "平 ";
        }else if(homeG < awayG){
          result.betCode = 0;
          t = order.awayTeamName + " 胜 ";
        }
        
        break;
      case 'RQSF':
        if(order.zou == 1){
          t = " 和 ";
        }else{
          if(order.prize == 1){
            result.betCode = order.betCode;
            
          }else if(order.prize == 2){
            result.betCode = order.betCode == 1 ? "2" : "1";
          }
          t = this.getbetText(result) + " ";
        }
      break;
      case 'DXQ':
         var odds=order.odds*1;
        if(order.zou == 1){
          t = " 和 ";
        }else{
          if(homeG+awayG > odds){
            result.betCode = 2;
           }else if(homeG+awayG < odds){
              result.betCode = 1;
           }
           t = this.getbetText(result) + " ";
        } 
      break;
    }
    if(order.betState == "-2" || order.prize == "3"){
      result.Text = "";
    }else{
      result.Text = t + result.Text;
    }
    return result;
  },
  getSpvBybet(betKind, kind, bet) {
    /*  
      betKind实例：  
      DXQ
      :
      {GameOdds: "2.75", GameBigOdds: 1.88, GameSmallOdds: 1.86}
      RQSF
      :
      {GameOdds: "1", GameHomeOdds: 1.88, GameAwayOdds: 1.73}
      SPF
      :
      {GameHomeWin: "1.51", GameStandoff: "3.60", GameGuestWin: "4.26"}
    */
    var betname = {};
    if (kind == "SPF") {
      betname = {
        "3": "GameHomeWin",
        "1": "GameStandoff",
        "0": "GameGuestWin"
      }
    } else if (kind == "RQSF") {
      betname = {
        "1": "GameAwayOdds",
        "2": "GameHomeOdds"
      }
    } else if (kind == "DXQ") {
      betname = {
        "1": "GameSmallOdds",
        "2": "GameBigOdds"
      }
    }
    return betKind[kind][betname[bet]];
  },
  getBetStateText(item){
    var tip = "稍后";
    var code = 0;//0
    var resulttxt = "等待开奖";
    var prize = 0;
    if(item.zou == 1){
        code = 1;
        prize = 1;
        tip = "中奖啦";
        resulttxt = "派奖中";
        if(item.winFee * 1 > 0){
          tip = "恭喜中奖";
          resulttxt = "+" + item.winFee / 100;
        }
    }else if(item.prize == 2){
       code = -1;
       prize = 2;
       tip = "很遗憾";
       resulttxt = "未中奖";
    }else if(item.prize == 1){
        code = 1;
        prize = 1;
        tip = "中奖啦";
        resulttxt = "派奖中";
        if(item.winFee * 1 > 0){
          tip = "恭喜中奖";
          resulttxt = "+" + item.winFee / 100;
        }
    }else if(item.prize == 3){
       code = 0;
       prize = 0;
       tip = "";
       resulttxt = "订单取消";
    } else if(item.prize == 15) {
        code = 1;
        prize = 15;
        tip = "中奖啦";
        resulttxt = "派奖中";
        if(item.winFee * 1 > 0){
          tip = "恭喜中奖";
          resulttxt = "+" + item.winFee / 100;
        }
    } else {
        if(item.betState * 1 < 4){
          resulttxt = this.betStateMap[item.betState];
        }else{
          resulttxt = this.prizeMap[item.prize];
        }
    }
    return {
      prize: prize,
      tip: tip,
      code: code,
      resulttxt: resulttxt
    }
  },
  checkDatestr(matchTime){
    return matchTime.replace(/^\d{4}-/g,"")
                    .replace(/:\d{2}$/g,"");
  },
  gethalfText(order) {
    var bettxt = {};
    switch (order.betKind){
      case 'RQSF':
        var odds = order.odds * 1;
        var oddtext = Math.abs(odds);
        var oddtext1 = Math.abs(odds) - 0.25;
        var oddtext2 = Math.abs(odds) + 0.25;
        bettxt = {
          "1": order.awayTeamName + " " + (odds >= 0 ? "+" + oddtext : "-" + oddtext),
          "2": order.homeTeamName + " " + (odds >= 0 ? "-" + oddtext : "+" + oddtext),
        }
        if(odds * 10 % 5 != 0){
          // oddtext = (Math.abs(odds) - 0.25) + "/" + (Math.abs(odds) + 0.25);
          bettxt["1"] = order.awayTeamName + " " + (odds >= 0 ? "+" + oddtext1 : "-" + oddtext1);
          bettxt["-1"] = order.awayTeamName + " " + (odds >= 0 ? "+" + oddtext2 : "-" + oddtext2);
          bettxt["2"] = order.homeTeamName + " " + (odds >= 0 ? "-" + oddtext1 : "+" + oddtext1);
          bettxt["-2"] = order.homeTeamName + " " + (odds >= 0 ? "-" + oddtext2 : "+" + oddtext2);
        }
      break;
      case 'DXQ':
        var odds = order.odds*1;
        var oddtext = Math.abs(odds);
        bettxt = {
          "1": "小于" + oddtext + "个球",
          "2": "大于" + oddtext + "个球"
        }
        var oddtext1 = Math.abs(odds) - 0.25;
        var oddtext2 = Math.abs(odds) + 0.25;
        if(odds * 10 % 5 != 0){
          // oddtext = (Math.abs(odds) - 0.25) + "/" + (Math.abs(odds) + 0.25);
          bettxt["1"] = "小于" + oddtext1 + "个球";
          bettxt["-1"] = "小于" + oddtext2 + "个球";
          bettxt["2"] = "大于" + oddtext1 + "个球";
          bettxt["-2"] = "大于" + oddtext2 + "个球";
        }
      break;
    }
    return bettxt;
  }
}